In [1]:
import numpy as np
import pandas as pd

### Pivot Tables

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': [
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South'
    ],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': [
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice'
    ]
}

df = pd.DataFrame(data)

In [3]:
df

         Date Product Region  Sales  Units    Rep
0  2023-01-01       A   East    344     42   John
1  2023-01-02       B   West    342     87   Mary
2  2023-01-03       C  North    714     13    Bob
3  2023-01-04       D  South    902     73  Alice
4  2023-01-05       A   East    243     42   John
5  2023-01-06       B   West    668     93   Mary
6  2023-01-07       C  North    994     43    Bob
7  2023-01-08       D  South    602     12  Alice
8  2023-01-09       A   East    555     55   John
9  2023-01-10       B   West    963     93   Mary
10 2023-01-11       C  North    230     11    Bob
11 2023-01-12       D  South    698     41  Alice
12 2023-01-13       A   East    947     79   John
13 2023-01-14       B   West    428     18   Mary
14 2023-01-15       C  North    263     92    Bob
15 2023-01-16       D  South    400     90  Alice
16 2023-01-17       A   East    753     10   John
17 2023-01-18       B   West    482     43   Mary
18 2023-01-19       C  North    304     31    Bob
19 2023-01-20       D  South    655     24  Alice

In [4]:
pd.pivot_table(df,values="Sales",index="Region",columns="Product")

Product      A      B      C      D
Region
East     568.4    NaN    NaN    NaN
North      NaN    NaN  501.0    NaN
South      NaN    NaN    NaN  651.4
West       NaN  576.6    NaN    NaN

In [5]:
pd.pivot_table(df,values="Sales",index="Region",columns="Product",aggfunc="median")

Product      A      B      C      D
Region
East     555.0    NaN    NaN    NaN
North      NaN    NaN  304.0    NaN
South      NaN    NaN    NaN  655.0
West       NaN  482.0    NaN    NaN

### Cross Tabs

In [6]:
pd.crosstab(df["Region"],df["Product"])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0